namespace IMU_PlatformTool2.Helper
{
    public static class InfoTextUtil
    {
        public static string GetCommConfigText()
        {
            return
                "・USB(VCOM)：\n" +
                "　USB通信のオンオフを切り替えます。\n" +
                "　オフの時に約5mAの省電力ができます。\n" +
                "　オフにした後、USB通信する場合は基板のUSBスイッチをオンにするとUSB通信が強制的にオンになります。\n\n" +
                "・FDCAN：\n" +
                "　FDCANのオンオフを切り替えます。\n" +
                "　通信相手次第で変化しますが短距離通信の場合、10秒間の平均で約20mA多く電流を使用します。\n" +
                "　通常のCANは未対応です。FDCANのみに対応しています。\n" +
                "　本機は複数機との通信は想定されていません。\n" +
                "　プロトコルについては別紙を参照してください。\n\n" +
                "・UART：\n" +
                "　UART通信のオンオフを切り替えます。\n" +
                "　オフの時に約2mAの省電力ができます。\n" +
                "　プロトコルはUSBと同じです。\n" +
                "　ボーレートは921kbps、データ8bit、パリティなし、ストップ1bit\n" +
                "　DEピンを使用することでRS485に対応できます。";
        }

        public static string GetImuConfigText()
        {
            return
                "・16bit読み込み：\n" +
                "　IMUから読み出す加速度およびジャイロを16bitで取得します。\n" +
                "　弊社で扱っているIMUでは、16bitを超える分解能で取得しても\n" +
                "　ノイズ成分が支配的となり、有効なデータが得られないため、\n" +
                "　32bitデータのうち上位16bitのみを使用しています。\n\n" +
                "・32bit読み込み：\n" +
                "　IMUから読み出す加速度およびジャイロを32bitで取得します。";
        }

        public static string GetFilterConfigText()
        {
            return
                "・重力補正オフ：\n" +
                "　加速度は使用せず、ジャイロのみで姿勢推定を行います。\n" +
                "　ロールおよびピッチ（X・Y軸）は重力の拘束を受けませんが、X・Y・Zすべての軸でドリフトが発生します。\n\n" +
                "・重力補正オン：\n" +
                "　加速度とジャイロを用いて姿勢推定を行います。\n" +
                "　ロールおよびピッチは重力によって拘束され、ドリフトはヨーであるZ軸のみに発生します。\n" +
                "　なお、重力補正オンの状態でIMUが実装されている面を下で起動すると、\n" +
                "　姿勢推定フィルタの初期値が不安定になることが確認されています。\n" +
                "　そのため、IMUが実装されている面を上にして使用してください。";
        }

        public static string GetInputPinConfigText()
        {
            return
                "・内部抵抗：\n" +
                "　INピンのマイコンの内部抵抗を設定します。\n" +
                "　初期値では3.3V(5V耐圧)のアクティブハイのパルス信号を想定しているため内部プルダウンを設定しています。\n\n" +
                "・トリガ条件：\n" +
                "　マイコンが送信するデータの一部である、INピントリガのフラグが立ち上がる条件を設定します。\n" +
                "　GPSが出力するPPS信号を取得する用途として実装しています。\n" +
                "　サンプルレートはIMUの制御周期と同じになります。";
        }

        public static string GetFilterSelectText()
        {
            return
                "姿勢推定の方式を選択します。\n\n" +
                "・姿勢推定しない：\n" +
                "　マイコンは姿勢推定しません。\n\n" +
                "・MKAE(Mahony)：\n" +
                "　LPFフィルタ行った後、相補フィルタで位相遅れを補正して、Mahonyフィルタで姿勢推定します。\n" +
                "　前回のTR-IMU-Platformではこれが使用されていました。\n" +
                "　前回から引き継いで、フィルタの外部にZUPTとバイアス推定が実装されています。\n\n" +
                "・VQF(double, Mixed, float)：\n" +
                "　このフィルタは姿勢推定の他にZUPT、ジャイロバイアスを求める処理が内蔵されています。\n" +
                "　動作中／静止中を判定し、ジャイロバイアスをカルマンフィルタで自動的に推定します。\n" +
                "　使いやすく、バイアス推定が高性能であるためデフォルトで選択しています。\n" +
                "　double / mixed / float により、演算精度と処理負荷を選択できます。\n" +
                "　使用しているSTM32U535は、double演算でも1ms未満で実行が完了しているのでdoubleを選択しています。\n\n" +
                "・Fusion(float)：\n" +
                "　x-io Technologiesが公開している組み込み機器向けのセンサフュージョンライブラリです。\n" +
                "　改良版Madgwick AHRSを使用し、シンプルなクォータニオンベースの姿勢推定を行います。\n\n" +
                "・未定義：\n" +
                "　ユーザがフィルタを追加した時用の枠組み。現在は未使用。";
        }

        public static string GetOptionText()
        {
            return
                "・設定の保存ボタン：設定を不発揮領域へ書き込みます。\n" +
                "　このボタンを押さない限り全ての設定値は保存されません。\n" +
                "　また、ドライバ基板のプログラムを書き換えると設定は全て初期値に戻ります。\n\n" +
                "・設定の初期化ボタン：全ての設定を初期値に戻します。\n" +
                "　押した時点では保存されていないので、必要あれば保存してください。\n\n" +
                "・再起動ボタン：マイコンを再起動します。\n" +
                "　全ての設定は起動時にしか適応されないので、保存後は電源を入れ直すか再起動してください。";
        }

        public static string GetBoardInfoText()
        {
            return
                "・ビルド日時情報：\n" +
                "　10進でビルドした日時をYYYYMMDDで表します。\n\n" +
                "・加速度の感度、ジャイロの感度：\n" +
                "　対応しているセンサ型番であれば、センサ型番ごとの感度が入ります。\n\n" +
                "・サンプルレート[Hz]：\n" +
                "　IMUを動作させているサンプルレートが入ります。\n" +
                "　サンプル毎に姿勢を計算しているので動作周期と同じになります。\n\n" +
                "・製品型番：\n" +
                "　センサ型番が入ります。\n\n" +
                "・基板名：\n" +
                "　基板名が入ります。\n" +
                "　\"TR-IMU-Platform2\"もしくは、\"TR-IMU1660X\"のみが入ります。";
        }
    }
}
